# GetCameraInfo Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewNode..::..GetCameraInfo Method
ViewNode Class See Also
---
Information about the observation point (the camera) of the view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public CameraInfo GetCameraInfo()
```

Visual Basic
---
```text
Public Function GetCameraInfo As CameraInfo
```

Visual C++
---
```text
public:
CameraInfo^ GetCameraInfo()
```

# ### Return Value
An instance of CameraInfo or nullNothingnullptra null reference (Nothing in Visual Basic) if there is no info associated with the view
# See Also
ViewNode Class
Autodesk.Revit.DB Namespace